{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4800","title":"Introduction to Speech Therapy","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course explores the fundamental knowledge required to manage speech and language disorders.","description":"This course was designed to teach you how to manage stuttering and other speech and language disorders, build confidence and reduce anxiety in those with these impediments. We'll go over the functions and responsibilities of a speech and language therapist, including teaching clients and the general public about communication impairments. In addition, learn how to diagnose and treat a variety of diseases. Register today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Speech and language therapists (SLT) are crucial in healthcare, from sensitising clients and the general public concerning communication disorders to overseeing less experienced therapists and managing disorders. SLT involves the study of human communication, its development and disorders. Such therapists evaluate speech, language, cognitive communication and oral skills to determine if a condition exists and how best to treat it. If this sounds fascinating to you, then look no further! This course will teach you all the skills and training you need to work as an SL therapist. We begin with an overview of speech science and speech production.&nbsp;</p><p>We will instruct you on how to teach children the language acquisition process to become fully fluent in their home language. Following that, we will walk you through the diagnosis and treatment of numerous speech and language disorders in children, such as dysarthria, OMDs and childhood apraxia of speech, a motor speech condition that exists from birth and inhibits a child's ability to make sounds and words. Finally, discover how to diagnose and treat speech sound abnormalities such as spasmodic dysphonia (SD), stuttering, selective mutism and apraxia of speech.</p><p>In addition, this course covers the knowledge needed to identify and manage speech conditions such as articulation difficulties, fluency and language disorders such as cognitive-communication and expressive disorders and medical illnesses such as dementia. Finally, discover practical ideas and strategies for improving a child's listening ability and exercises for children with fluency issues and reluctant speakers. Learn more about SLT by enrolling in this course today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}