{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/5194","title":"Introduction to British Sign Language","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online sign language course teaches you how to use British Sign Language to communicate with deaf people.","description":"British Sign Language (BSL) is a part of the culture and daily life experience of approximately 90 000 deaf people in the UK. This step-by-step course explains how to conduct basic conversations with other BSL users. We show you how to fingerspell the alphabet and various names. We also go over useful sign words and phrases for meetings, greetings, describing people and animals, weather, travel, directions, colours, sizes and numbers.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course provides some basic British Sign Language (BSL) terms and expressions that allow you to interact with deaf people in social or professional environments. After learning about BSL, you'll practise fingerspelling each letter of the alphabet with both hands. We then demonstrate how to combine fingerspelled letters to sign names. The course also demonstrates how to use signs for everyday words such as ‘bathroom’, ‘living room’ and their contents.</p><p>We then explore the use of BSL to convey a variety of greetings, inquiries, opinions, introductions and taking-leave terms such as ‘hello, nice to meet you’, ‘my name is Emma’ and ‘see you soon’. After that, the course teaches you how to use sign language to describe various individuals, your family, pets or other animals. We demonstrate how to use BSL and its unique grammar that differs from English’s to talk about your mother's name, your look, your pet's characteristics or your family members.</p><p>The course shows you how to combine different signs to discuss the weather and modes of transportation to create a dialogue. Finally, we outline the BSL gestures used to identify colours, sizes, numbers and time. This introductory BSL course is taught by a teacher with over twenty years’ experience and helps you to develop your ability to communicate with other sign language users while also improving access and inclusion for deaf people. Enrol now to learn a valuable new skill and add sign language to your professional portfolio.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}