{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/3664","title":"Italian Language Studies - Intermediate","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Become an 'italiano vero' - a true Italian - by studying the Italian language with this free online language course.","description":"This course follows ‘Italian Language Studies – Introduction’, which is also on Alison. It looks at different subjects and vocabulary regarding Italian culture at an intermediate level. It also goes into detail about grammar rules that will help you start speaking and writing accurately in Italian. You will follow along while the teacher reads complex texts and translates them to English. Progress to a more advanced level by enrolling today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>In this course, you will learn grammar rules regarding nouns, such as how to change them from the singular to the plural form, whether they are masculine or feminine. You can then use this new vocabulary to build phrases and sentences properly. Following this, you will learn about numbers and time, such as counting from zero to more than one million and learning how to tell and ask for the date in Italian plus relevant texts referencing historical dates.&nbsp;</p><p>There are a variety of elaborate texts that the teacher reads and explains on interesting subjects such as: ‘il corpo’ (the body), ‘il cibo’ (food), ‘le professioni’ (jobs), ‘i colori e i vestiti’ (colours and fashion), ‘parlare degli altri’ (learn to speak about different people, describing their physical characteristics) and finally ‘cosa ti piace e non ti piace fare’ (learn to tell and ask what you like and what you don't like to do). With this, a new lexicon is presented to you to learn and study after watching the video lessons.</p><p>Why learn a new language? The Italian language is one of the most studied languages in the world. Students are fascinated by the musicality and sweetness of its words. Italy has one of the biggest and most relevant contributions to the world through its cultural heritage in art and science. Italian brands in fashion, the automobile industry and food are famously known because of their excellent quality. In this course, you will study interesting texts on these subjects to learn more details about this beautiful country.</p><p>You will also be able to complete numerous exercises with feedback on each question and assignment. Each lesson is taught by a native Italian teacher - Beatrice, Bianca or Sara - in both Italian and English. Why delay? Start your journey to become an Italian speaker and enrol today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}