{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4707","title":"Korean for English Speakers","totalEnrolled":"3,212","courseIncludes":["3-4 Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Converse like a native Korean speaker by learning how to read, write and speak Korean in this free online course.","description":"Do you enjoy interacting with people from different cultural backgrounds? This course provides an excellent opportunity to learn Korean independently with easy-to-follow and straightforward lessons. Explore several valuable words and phrases for your daily life, including numbers, nouns and expressions for different occasions. This course makes learning Korean easy and fun to help you communicate with native speakers comfortably and fluently.","courseOutcomes":["Compare the two common number system...","Recall different Korean words and ph...","Translate commonly used English word...","List useful Korean phrases for perso...","Compare the two common number systems in the Korean language","Recall different Korean words and phrases for daily use","Translate commonly used English words and sentences into Korean and vice versa","List useful Korean phrases for personal and professional use","Label various colours, days of the week, months of the year and more in Korean","Describe physical appearances in Korean","Discuss useful Korean phrases for use at restaurants and hospitals","Match different Korean phrases with their corresponding English phrases","Compare the two common number system...","Recall different Korean words and ph...","Translate commonly used English word...","List useful Korean phrases for perso...","Compare the two common number systems in the Korean language","Recall different Korean words and phrases for daily use","Translate commonly used English words and sentences into Korean and vice versa","List useful Korean phrases for personal and professional use","Label various colours, days of the week, months of the year and more in Korean","Describe physical appearances in Korean","Discuss useful Korean phrases for use at restaurants and hospitals","Match different Korean phrases with their corresponding English phrases"],"courseDescription":"<p>The alphabet serves as a basis for any language learning and aids our ability to read and write as individuals. This course introduces the Korean alphabet, called ‘Hangul’, and outlines the sounds attached to every consonant and vowel. Numbers are a small but valuable part of any language because you use them extensively in everyday life. Learn how to count using the two number systems employed in the Korean language and study how to use these systems. We use days of the week, colours and months of the year in daily conversations. Gain an insight into the Korean vocabulary for each of these and family-related words, which are essential because we spend a substantial amount of time with our families. Do you have friends and families that are native Korean speakers? We will teach you different terms related to family and relatives and help you build your vocabulary for household use.</p><p>Emotions can be positive or negative. You'll often find yourself in situations where you need to communicate them properly. Discover different ways to express yourself and share your feelings in particular situations. Greetings are essential and serve as a first approach to communicating with someone new. Explore various useful Korean phrases used for meeting people and striking up positive conversations. We'll teach you several valuable sentences commonly used in a telephonic conversation. Travelling to a new country requires you to have some travel-related vocabulary and phrases at your disposal to move around as a tourist quickly. We will teach you travel and tourism-related phrases, including asking for directions and locations. Do you like to go outside and eat at restaurants? We cover a range of basic Korean words and expressions to use at a restaurant and order the food you want.</p><p>We designed this course for people who want to learn Korean and interact with Korean speakers. This basic-level course does not require any prior understanding of the Korean language. Do you know that South Korea is famous for its pop culture and technological advancements? All this makes travelling to South Korea desirable for tourism and work-related opportunities. Learning Korean will greatly help you if you want to visit Korea or work there. Moreover, learning a new language improves your brain functions by boosting your cognitive and problem-solving skills. Don't miss out on the opportunity to learn Korean. Join the course now and learn for free!</p><a href=\"https://alison.com/resume/courses/4707\" class=\"l-but course_btn\">Start Course Now</a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\">certificate</span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\">certificate</span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\">certificate</span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\">certificate</span>:</strong> a downloadable <span class=\"course-type\">certificate</span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\">certificate</span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\">certificate</span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\">certificate</span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"https://alison.com/resume/courses/4707\">Start Course Now <span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\">certificate</span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\">certificate</span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\">certificate</span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\">certificate</span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"Module","details":"Everyday Korean Words and Phrases","description":"This module will introduce you to the Korean writing system and numbers. To establish a solid vocabulary, you will study useful Korean words and terms that are used on a daily basis. Learners will be taught a number of everyday phrases to convey their exact message on topics, including greetings, emotions, travel, shopping, tourism and many more.","topics":["Everyday Korean Words and Phrases - Learning Outcomes","Common Words Part 1","Common Words Part 2","Everyday Phrases Part 1","Everyday Phrases Part 2","Everyday Korean Words and Phrases - Lesson Summary"]},{"name":"Module","details":"Course assessment","description":"","topics":["Korean for English Speakers - Course assessment"]}]}