{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4344","title":"Discuss your Family and Occupation in Arabic","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course will teach you the essentials of Arabic conversation regarding family and occupation.","description":"Did you know that in Arab families, the notion of ‘self space’ differs from Western culture? In general, Arabs usually stand nearer to their same-sex communication partner. As a result, it is critical to understand these cultural differences while interacting with others as they have complex requirements. So enrol today and start learning to communicate about your family and profession in Arabic in only two modules!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This course introduces you to the basic everyday conversation in Arabic about family and occupation. It begins by demonstrating how to have distance-related conversations. First, you will explore how to convey your current location. Next, you will learn to ask for directions and indicate how far or close you are to an object in Arabic. Following that, you will explore the various kinds of Arabic conjunctions and how they connect different parts of a sentence.</p><p>The following section focuses on conversations about professions in Arabic. You will explore Arabic terminology for various occupations. Furthermore, you will learn that work titles and callings by profession differ in Arabic and you will study both of them. You will also learn Arabic terminology for both male and female members of various occupations. Next, we will explain various Arabic phrases for addressing marital status. You will discover how to convey if someone is single, married, engaged or widowed in Arabic.</p><p>The final section illustrates the transition from singular to plural in Arabic. You'll discover that irregular nouns have two plurals and how to create them. Next, you will explore how to make plural forms of verbs, feminine words and different professions. You will also have an opportunity to put everything you have learned in this course into practice. Lastly, we will highlight the differences in the lexicon and pronunciation of the 'Shamya' dialect. So enrol in this course today and learn how to deal with situations related to family and occupations that require knowledge of Arabic in just 32 videos.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}