{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/5674","title":"Learn Spanish: The Alphabet and Verb \"Ser\"","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, you will learn the basics of Spanish, from the verb “ser” to greetings and short phrases.","description":"This free online Spanish course will help beginners learn one of the world's most spoken languages. Over 500 million people worldwide, in over 20 countries, speak Spanish. This entry-level Spanish course contains modules on the alphabet, everyday verbs, and helpful vocabulary to initiate everyday conversations. By the end of this course, you will be able to talk about your job, greet new people, and introduce yourself in Spanish.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This free online Spanish course for beginners has three parts: pronunciation, grammar, and vocabulary. First, you will learn the alphabet and common and proper nouns. This part of the course includes audio files by native speakers to help you pronounce each letter correctly. You will also learn to correctly pronounce a unique letter in the Spanish alphabet, the letter Ñ.</p><p>Once you know how to pronounce the alphabet correctly, you will learn about articles and the verb “ser,” the most common verb in Spanish. In this section of the course, you will also learn about nouns, pronouns, and jobs. Understand the difference between feminine and masculine nouns and how to use the gender articles correctly, as they are very important in Spanish. The last part of the course will teach you essential vocabulary for greeting people, such as “hola” and “¿cómo estás?” By the end of the course, you will be able to have a short conversation with a Spanish speaker.</p><p>This beginner-level Spanish course is perfect for students with no Spanish knowledge or anyone wanting to review the basics. We have designed this course to include many audio examples from native speakers to help you learn. There are questions in each topic as well as the end 'Course Assessment' section to review your progress. &nbsp; Enroll today and start speaking Spanish.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}