{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4523","title":"Learn to Read and Write in Arabic","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the alphabet, pronunciations and grammar rules to master reading and writing Arabic in this free online course.","description":"This course is designed to help you quickly learn or improve your reading and writing skills in Arabic. You will study the Arabic alphabet and vowels, recognize them in sentences and learn to write and pronounce each letter. You’ll become familiar with the changing shapes of the letters and how you can combine them to form words and simple sentences. We have included the basic grammar rules that guide you to fluency and expand your vocabulary.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This Arabic language course is developed for beginners who want to read and write in Arabic. Radwa Obayd, a native Arabic speaker and the founder of Arabic Blooms, is an engaging instructor who communicates with simplicity and clarity. The course includes video lessons, audio clips and quizzes to help you practise and measure your progress as you complete the lessons. We encourage you to stop and practise intermittently to reinforce learning and build proficiency over time. We will go over the Arabic alphabet, vowels and basic grammar rules. You will even pick up tips to help you sound like a native speaker.</p><p>We begin with the twenty-eight letters of the Arabic alphabet. Learn to recognize each one, pronouncing them correctly and emphasizing the articulation points of the letters. We will then discuss the changing shapes of Arabic letters. When you join them, all the letters change their shapes to form words with other letters. In some cases, you add lines, while in others, you remove sections of the characters. We then explore the Arabic vowels. Originally, Arabic vowels were not part of the written language and today, in some instances, Arabic books or journals do not indicate the short vowels. This section of the course covers all these areas. You will begin learning the short and long vowels, then add the tanween, sukoon, double consonants with short vowels and double consonants with tanween.</p><p>Next, we will delve into the basic reading and writing rules in which you will learn to differentiate between the 'taa' and 'haa' sounds. Then discover the exceptions in the Arabic writing system - the letters written and not pronounced and the letters pronounced but not written. Finally, you will learn to read Arabic, identifying the sun and moon letters. The exercises found in the lessons and course manual will give you ample opportunity to practise and will help you improve your communication skills in Arabic. If reading and writing in Arabic is your goal, this course will help you get started. It's free and you can begin immediately. Sign up today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}