{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4397","title":"Mandarin for Beginners","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course teaches how to communicate in Mandarin and Pinyin, Chinese's Romanised phonetic system.","description":"In this free online course, we will introduce you to Mandarin and Pinyin, the phonetic system of the language. You will examine the syllables, tones and spelling rules of Mandarin. In addition, we will discuss the number system and sentence patterns in Mandarin. By completing this Mandarin course, you will develop your mental aptitude, enhance your travel experience and attain a global business and economic advantage.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>China is the most populous country globally with over 1.25 billion people. It boasts one of the oldest and richest histories and cultures, from poetry to novels, biographies to sportsmanship and medicine to cinematography. Cantonese and Mandarin are the two most widely spoken Chinese language forms. Cantonese is the preferred dialect of over 50 million people while Mandarin is the most-spoken form of the language, with over 1.1 billion native and non-native speakers. As such, Mandarin is the most widely spoken language in the world! In this free online course, we will introduce you to Pinyin, the romanised phonetic system of the Chinese language. You will learn about ‘initials’ and ‘finals’ (also known as the ‘consonants’ and ‘vowels’ of Mandarin) and the four tones in Pinyin. Additionally, you will study the four groups of 36 finals, 21 initials and the four situations for scripting the zero-initial syllables in Pinyin.</p><p>Next, you will consider the tone markings for the Pinyin finals. Explore how to find your voice range for the different tones used in Chinese conversations. We will delve into the spelling rules and analyse the tone changes using practical examples. In addition, we will introduce the Chinese mode of greeting, including the sentences and phrases for exchanging pleasantries in informal and formal situations. Learn some vital tips that will help you master your pronunciation and avoid unnecessary confusion while speaking. Research the Chinese system of numbering and use the simple techniques for coining the terms employed for higher numbers versus lower ones. Examine the Mandarin terms used for colours or to reference different objects and describe them via the measure words and structure patterns in Pinyin.</p><p>Finally, you will consider the concept of ‘complement of state’ in Chinese grammar. First, some Chinese pronouns will be highlighted, including how you can use them in Mandarin lingo involving physical exercise and body fitness. Then we will explain the various sentence patterns in the Chinese language with illustrative examples and exercises. Next, discover some common verbs used in conversations, including the two verbs that you can use to express your desire to perform a particular task. This course uses a reader-centred approach and will help you grasp the Chinese language's basic terms, sentences and sentence patterns. Your mastery of this language will help you create lasting connections, enhance your travel experience and give you a competitive advantage in the job market. So why wait? Start learning now!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}