{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4376","title":"Master the Art of Personal Conversations in Arabic Language","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Continue your expedition through the Arabic language by refining your fluency with this free online course.","description":"Learn to communicate in Arabic for everyday situations. With this virtual course, you'll learn how to answer basic questions like ‘where are you from?’ as well as verb conjugation, salutations and more. When conversing, learn when to respectfully close and leave the conversation. Strengthen your fluency in the Arabic language by engaging in basic conversations in the Egyptian and Shamya dialects with this online class.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The Arabic language and the culture of the Middle East offer influential intellectual, artistic and culinary treasures of human history. Mastering a language entails understanding and appreciating what you've discovered. Did you know that classical Arabic has a 1500-year history? Arabic literature is one of their most enduring gifts to the West. It is an element of Middle Eastern culture that, although only given superficial respect, actually offers valuable insights into Arab civilisation. Arabic terminology has an extensive dictionary and an endless list of words for expressing the same idea differently. Therefore, if you listen to Arabic poetry without first learning the acoustics of the language, the voicing will be unfamiliar to your ears. Allow yourself to immerse into the Arab ethnology by developing new words and phrases. Mohamed Elshenawy, your tutor, will ensure that each step of your Arabic journey consists of comprehending the rich culture and history of the Arab world.</p><p>Why is it so vital to study Arabic? It is a rich Semitic language with a mixture of dialects that could help your CV stand out. As a result, studying Arabic will enable you to travel, work and explore the Arabian Peninsula, the Middle East and North Africa. Understanding Arabic will help you grasp the complexity and intricacies of this culture, which is often misinterpreted and misrepresented. We combat geographic and cultural ignorance through education. Taking the first steps in improving language skills should be introducing yourself. This course will guide you step by step, starting with basic Arabic expressions and vocabulary. You will learn practical wording, questions, how to reply to the traditional 'where are you from?' and dialect nuances between the Eastern Arabic and Egyptian accents. In the second part, 'Exercising Expressions and Language Rules', the tutor will help you learn grammar rules for gender-specific phrases and verbs based on whom you're speaking to. Then, you will study how to close and respectfully leave a conversation. You will rehearse the throat intonation while conjugating verbs with personal pronouns, regular/irregular nouns and plural rules in the Arabic language.</p><p>Some people claim that learning Arabic takes many hours. However, you will find everything you need to start in 'Master the Art of Personal Conservations in the Arabic Language’. Begin speaking and writing popular expressions in Egyptian and Shamya dialects that will help in your travels. Your genuine interest in the language and mastering the Egyptian dialect (also known as ‘Masri’ or ‘Masry’) will allow you to communicate with nearly 55 million people. The instructional strategies will help enhance your communication skills to interact with natives in the Arab world. Nobody is making promises that studying this language will be easy. But the challenge might sharpen the way you think. Competence in the Arabic language can lead to various changes in your life, including greeting your neighbours in their original language and making them feel more welcome. Are you up to the challenge of 'Mastering Art of Personal Conservations in the Arabic Language'? Register today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}