{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4336","title":"Portuguese for Beginners","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"In this free online course, study the basic structures and syntax of the Portuguese language with practical examples.","description":"In this free online introductory course, you will study the basic structures and syntax of the Portuguese language. You will learn the most practical system of understanding the language via common words, simple phrases and useful expressions via step-by-step videos. By completing this course, you will be able to develop your vocabulary, build your confidence and speak fluently in the Portuguese language. Enrol now!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Learning a new language is complex, requiring hard work, commitment and perseverance. However, learning a new language helps break social barriers, broaden your horizons and open professional doors. Portuguese is one of the Romance languages and if you combine the right strategies and resources with your steady motivation, learning the language will be a delightful experience. It is also noteworthy that Portuguese is the official language spoken in Brazil, with over 200 million native speakers, making it the second-most popular language in South America. It is also widely spoken in Portugal and some regions of Africa and Asia.</p><p>In this course, you will start by learning simple sentences for exchanging pleasantries and introducing yourself (known as 'cumprimentos') in Portuguese. You will explore the various forms of greetings, including the right words to say in the morning, afternoon and evening while addressing other people. Learn how to converse with your friends and express respect for the elderly. You will study the 'números' (the Portuguese system of numbering) and the 'cores', the general term used for different colours in Portuguese. In addition, you will discover the terms for Portuguese foods, including 'Os hidratos de carbono', 'A proteína', 'Os legumes', and 'As frutas', which represent the Portuguese terms for four classes of foods. Then you will learn how the English alphabet differs from the twenty-six letters of the Portuguese alphabet and how to pronounce the latter correctly.</p><p>Furthermore, you will encounter 'Os animais' and 'exercisio fisico', the general terms used for animals and physical exercises in Portuguese. Analyse verb conjugations, also known as 'conjugação dos verbos', and the rules that guide the conjugation of Portuguese verbs ending in '-ar', '-er' and '-ir'. Distinguish between the regular and irregular verbs and the difference between the 'Ser' and 'Estar'. Finally, consider the Portuguese concept of date and time, days of the week, from 'Segunda-feira' to 'Domingo' (Sunday to Monday) and the months of the year, from 'Janeiro' to 'Dezembro'. Mastering Portuguese will help you create lasting connections, enhance your travel experience and give you a competitive advantage in the job market. So, why wait? Start learning now!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}