{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/3428","title":"PRONTO! Italian Language Studies - Introduction","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the language and become an 'Italiano vero' - a true Italian - with this free online language course.","description":"Become an 'Italiano vero', a 'true Italian' by studying the language and learning about Italian culture in this free online course. Master the four pillars of the Italian language: Parlare (speaking) , Scrivere (writing), Leggere (reading) and Capire (understanding). This course is designed to guide students through the basics of the Italian language through video-led lessons that teach vocabulary, grammar and pronunciation.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Learn grammar and master all the technical aspects of the Italian language, from basics such as the use of prepositions, conjugation of regular and irregular verbs, and singular and plural forms of nouns, to articles, and the use of adjectives and adverbs in this free online course. You will be introduced to the pronunciation of Italian ‘vocali e consonanti’ (vowels and consonants), with exercises where you will be guided to achieve the correct and authentic pronunciation. You will also be introduced to vocabulary and conversational Italian in ‘situazioni formali e informali’ (formal and informal situations), ‘presentarsi’ (how to introduce yourself), ‘parlare di te stesso e degli altri’ (talking about yourself and others), ‘dire e chiedere da dove vieni’ (conversation about where you come from), and ‘e tantissimi altri temi’ (and many other subjects).</p><p>Why learn a new language? Mastering a new language can change your life socially and professionally. Think of all the people and experiences that are on the other side of you mastering this language. ‘L’Italiano’ is considered by some to be the true language of love and is the fourth most studied language in the world. The lessons are taught by Italian teachers Beatrice, Bianca or Sara. Your teacher will lead a video lesson, with PDFs of the content also available for download.&nbsp;</p><p>This course was built by an amazing team of Italian teachers with the objective of teaching Italian while bringing students as close as possible to Italy and its culture, food, music and beautiful places. So why wait? Start your journey to becoming an Italian speaker by enrolling and learning a new skill today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}