{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4676","title":"Spanish Made Easy","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn the basics of the Spanish language and develop your vocabulary using everyday phrases in this free online course.","description":"Are you a traveller who frequently visits Spanish-speaking countries? Do you want to learn Spanish but aren't sure where to begin? We have divided the course into two sections: one for building basic vocabulary and the other to help you understand and speak simple sentences in Spanish. Explore many new words you can start using in your everyday speech. This course makes Spanish learning fun and communicating with native speakers easy.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Learning Spanish is an excellent choice if you love to travel and prefer some understanding of the local language. It is the official language of 20 countries and more than 500 million people are native speakers. The course kicks off by introducing you to Spanish numbers. We will teach you Spanish numbers and how to use them in your day-to-day interactions. Alphabets are essential because they shape the foundation of language and communication. We explore the Spanish alphabet and the sounds associated with each consonant and vowel. Moving around in a new country and setting up your schedule requires you to learn the days of the week in the local language. Discover the days of the week and learn their proper pronunciations. To widen your vocabulary, learn the names of colours, countries and nationalities, professions and animals. Knowing how to greet people in their language is important when travelling to a new place. We will show you the Spanish words and phrases used to meet and greet new people.</p><p>Whether you want to tell people how they look or describe your physical appearance, this course provides you with a suitable collection of words to describe different physical attributes. There are many ways to ask permission - some formal and others informal. We provide simple sentence structures to help you ask permission to do or have something. Often you come across situations where you need to say ‘no’ but fear it will sound offensive to the other person, especially if the culture differs. You will learn to say ‘no’ politely in Spanish without sounding offensive, ask questions, make declarative statements and express disagreement in Spanish.</p><p>We designed this course for people who want to learn Spanish and interact with Spanish people. This course is taught at a basic to intermediate level and requires no previous Spanish language knowledge. It covers both vocabulary building and how to construct simple phrases and sentences. Spanish is the second-most widely spoken language in the world after Mandarin Chinese. Moreover, if you are looking for job opportunities abroad and Spanish is the medium of communication in that country, learning the basics of the Spanish language will help you succeed. So don’t miss out on the opportunity to learn Spanish. Join the course now!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}