{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4403","title":"Tagalog Filipino for Beginners","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Gain basic introductory conversational and comprehension skills for Tagalog in this free online course.","description":"In this introductory course, you will study the fundamentals of the Tagalog language. Learn the Tagalog alphabet and numbering system as well as various greetings for different times of the day and occasions. We will also present the vocabulary for meals, animals, family roles, community, geography and weather conditions. You will attain the skills to formally and informally converse and express yourself in Tagalog. Enrol today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>The Philippines has over a hundred different languages spoken around the country but the national language known as ‘Tagalog’ remains the strongest and the most-spoken language of all. Would you like to learn the fundamentals of this beautiful language? This free online course has been designed to introduce you to the basics of the language. We will begin by acquainting you with the most common greetings used at different times of the day. You will then learn how to introduce yourself using your name and tell basic information about yourself. After that, you will study the Tagalog alphabet. Learning and getting acquainted with its alphabet is critical for a person to become familiar with any language. Explore the correct way to pronounce the Tagalog alphabet and the different scenarios where you should use each distinct letter.&nbsp;</p><p>Next, you will study the numbering system in Tagalog. Learn to pronounce and count the numbers from one to ten and then discover how to form numbers in tens, hundreds and thousands. Discover how to write the date and time and memorise days of the week and months in a year. We will demonstrate the correct way to combine days, months and the year to the current date. The next section of the course will teach you basic Tagalog vocabulary. You will learn about different colours and sentence formations with different colours. Following that, you will learn about various meals in Tagalog, examining words and phrases used to represent food items. We will then tackle the names of several animals and insects in Tagalog.</p><p>In the final section, you will learn how to address family members. We will explain different roles in a community. For instance, you will learn what firefighters do and how they are referred to in Tagalog. The Philippines is an archipelago that has diverse terrains in its geographical structure. The next section of the course will explain the specific words used to represent different geographical terrains. Lastly, you will study weather conditions and memorise the different seasons in Tagalog. This course will serve as a solid foundation to build on mastering this fascinating language. Whether you are a linguist or fancy learning new languages, this course is perfect for you. Take advantage of this opportunity and enrol today.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}