{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/5232","title":"Teaching English as a Foreign Language (TEFL)","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Learn how to teach English as a second language in this free online TEFL training course and climb up the TEFL ladder.","description":"Teaching English as a foreign language (TEFL) is one of the world's fastest-growing educational fields. With over 100 000 open TEFL positions around the world, not including online learning, this field offers excellent employment opportunities for teaching English. This course is designed to train you to meet the standards required of a successful TEFL teacher. Sign up to turn your English skills into exciting work and travel opportunities.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>English is spoken by over 1.75 billion people as a first or second language and is a global language widely used in many fields, from engineering to art and medicine. The demand for standard English teachers will thus rise as more and more people seek to learn the language. We designed this TEFL course for anyone interested in turning their English skills into a career in this field. We begin with an overview of the fundamentals of TEFL, which include applied linguistics, pronunciation and teaching methodologies.</p><p>Lesson planning is one of the most important responsibilities facing TEFL teachers and requires that they set long-term goals and learning outcomes for their classes. We provide effective lesson planning and teaching methods to help you choose the right content and deliver it successfully. We show you how to use games and activities to help students learn English and examine the role of information technology in teaching grammar and vocabulary in classrooms and online. TEFL requires more than English skills and we provide the pedagogic training you need to teach, including classroom and time management and the steps taken to motivate students.</p><p>This course provides the abilities required to help others with early language acquisition as they navigate a new linguistic culture. These abilities can be honed through practice exercises found in our ‘Resources’ section. Finally, we discuss employment opportunities available for TEFL teachers and explain how to advance your career teaching English as a second language. Many people use their TEFL training to finance travel abroad or to generate extra income. Sign up for this course to turn your English skills into a career as a TEFL teacher.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}