{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4335","title":"Turkish for Beginners","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online course covers the basic principles of Turkish grammar and pronunciation and provides vocabulary.","description":"This free online course will teach you the basics of the Turkish language. You will learn the Turkish alphabet and how to pronounce letters. We will describe everyday greetings, formal introductions and essential vocabulary. We will also cover basic grammar and terminology related to colours, numbers, animals, dates and times. You will learn to converse in simple sentences and understand simple grammar rules in Turkish. Enrol today.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Are you a fan of the Turkish language and want to communicate like a native? If so, you've come to the right place. This free online course will assist you in understanding and learning the fundamentals of Turkish. First, we will introduce you to the Turkish alphabet and how to pronounce each letter. We will use several examples to practise the various sounds and pronunciations and then teach you how to greet someone and make a formal introduction. We will also explain multiple greeting phrases used at different times of the day. Following that, you will learn how to describe numbers from one to ten and how to structure numbers with tenths, hundreds and thousands.</p><p>The course will also explore the vocabulary used in Turkish to represent various colours. We will provide several examples to practise their names. The course's most exciting section will be about Turkish cuisine. We will research the vocabulary related to essential food items and how you can use this in sentence structures. We will then study the names of various animals. Throughout the course, we demonstrate using varied practice exercises to help you focus on sentence structure pronunciations and grammatical rules. We will also provide exercise and fitness vocabulary. We will highlight several important verbs used in everyday life and their formations in the present tense.&nbsp;</p><p>This course will also teach you how to conjugate verbs. Specific rules regarding vowel harmony and verb formations in Turkish will help you converse like a pro. We will use several examples to demonstrate these grammatical rules and formations. Date and time expression is an integral part of any language. Study the months of a year, days of the week and how to tell the time in Turkish. Numerous key phrases used in everyday conversations, such as ordering a meal or complimenting someone, will be taught. This course is appropriate for anyone who wants to build a strong foundation in Turkish and is ideal if you are a professional linguist or someone who enjoys learning languages. Sign up today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}