{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/4248","title":"Understanding the Different Facets of Everyday Conversations in Arabic","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"Master the basics of everyday Arabic conversation and common phrases with this free online language course.","description":"Did you know that Arabic is the fifth most used language in the world? It is spoken natively in more than 20 countries by over 300 million people. Knowledge of Arabic broadens your horizons and allows you to live and work in several different destinations. Start learning by mastering the basic conversation in Arabic introduced in this course in just two modules with easy-to-follow videos.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Arabic is an Afroasiatic language that is the official language of the Arab League, which consists of over 20 countries. Native speakers mostly live in the Middle East and North Africa, and Arabic is one of the six official languages of the United Nations. This course introduces you to basic everyday conversation in Arabic. It starts with explaining how to discuss your daily routine. In addition, you learn how to have a phone conversation and invite a friend over in Arabic. You’ll also discover how to talk about the weather, books, work, or family.</p><p>Next, you explore how to find your way around and orient yourself in Arabic. How to ask for directions and rent a car is explained. You will learn how to ask how to use public transport systems such as the subway, aeroplanes and buses. We'll also go over several useful Arabic phrases that you'll hear in banks and museums. Exchanging money, shopping and visiting the supermarket is explained. You’lll also discover how to order pizza or have a proper conversation in a restaurant.</p><p>The final section unpacks how to rent an apartment or check in at a hotel. In case of emergency, making an appointment with the doctor or answering questions in a hospital is described. You’ll explore the ways of expressing bad feelings between people. Whether we like it or not, insults are also part of the language and you’ll learn some abusive words that native speakers commonly use in daily life. So sign up for this course now and learn how to successfully deal with situations that require knowledge of Arabic in a series of videos.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}