{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/5081","title":"Upper-Intermediate English 401","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online English course teaches you to discuss your fears using extreme adjectives and adverbs.","description":"This English course will test your understanding of various fears and how people respond to them and broaden your vocabulary in these areas. It also enhances your grammar by teaching you how and when to correctly use adjectives and adverbs and the similarities and differences of the intensifiers 'such' and 'so.' We recommend this course if you want to improve your core English skills and keep making progress. Enroll today!","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>This English course will begin by expanding your vocabulary by teaching you about individuals' fears and how they react to those fears in different ways. Then, to help you further develop your English abilities, there are reading materials, video tutorials, and audio recordings accessible to you so you learn to pronounce words correctly.</p><p>The first grammar topic reviews adjectives and adverbs, including how to tell the difference between adjectives that end in '-ed' and those that end in '-ing.' It also talks about 'extreme adjectives' and how to use them instead of adverbs with weaker adjectives. The second grammar topic teaches you more about the intensifiers 'so' and 'such,' their similarities and differences, and how to use them with or without 'that.'</p><p>We have designed the final section of this course to help you become a more fluent English reader, speaker, and writer. Also, you will acquire new vocabulary linked with fear and all individuals' responses to it. A downloadable writing assignment is provided in the 'Resources' section to help you immediately practice your newfound knowledge. Make progress in English and register for this course today!</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}