{"subjectName":"Language","subjectDescription":"Would you like free online French lessons? Or perhaps you’d prefer to learn German or find Spanish classes online? No matter the language - whether it’s French, German, Spanish, Italian, English, Japanese, or even sign language - if you’d like to... Read more...","subjectBg":"https://cdn01.alison-static.net/search/header-img/language.jpg","resumeLink":"https://alison.com/resume/courses/5148","title":"Upper-Intermediate English 406","totalEnrolled":"-","courseIncludes":["Hours of Learning","CPD Accreditation","Final Assessment"],"headline":"This free online English course discusses movies and how to use the future perfect and future perfect continuous tense.","description":"This English course provides the vocabulary for discussing the cinema or going to the movies. Study the future perfect and future perfect continuous tenses while comparing them to the future simple tense. Explore how to use 'will' and 'going to' to describe plans and predictions in noun clauses. We demonstrate how 'going to' and 'would' are used to discuss plans that have since changed or been abandoned. Sign up to polish your English skills.","courseOutcomes":["-","-","-","-","-","-","-","-"],"courseDescription":"<p>Watching movies at home or in the cinema is a popular leisure activity, and fans love discussing their favorite films, how they were made, and who starred in them. We have therefore designed this course to teach you basic vocabulary related to movies and filmmaking. This English course helps you master the language used to converse about your favorite movies, characters, and actors.</p><p>We cover two grammar topics. First, we review the future perfect tense and compare it to the future simple tense to help you understand when it is more appropriate to use each. We introduce you to the future perfect continuous tense and demonstrate how to use it to form statements and questions. The second grammar topic covers discussions about plans, intentions, and predictions. We show you how to use 'will' and 'going to' when discussing the future. The course also covers their use as part of noun clauses. We examine 'would' in noun clauses to discuss once-laid plans that have since changed or did not happen.</p><p>You will then integrate your new grammar and vocabulary skills by practicing reading, listening, and writing using what you have learned about the movies, filmmaking, the future perfect, the future perfect continuous, and 'will' and 'going to.' Continue to progress as an English student by ensuring that you take the time to practice. To help you further your skills, we have included some writing tips and exercises in our 'Resources' section. Sign up today and gain confidence when discussing movies with your friends.</p><a href=\"\" class=\"l-but course_btn\"> Start Course Now </a>","certificateDetail":"<p> All Alison courses are free to enrol study and complete. To successfully complete this <span class=\"course-type\"></span> course and become an Alison Graduate, you need to achieve 80% or higher in each course assessment. Once you have completed this <span class=\"course-type\"></span> course, you have the option to acquire an official Diploma, which is a great way to share your achievement with the world. </p><div class=\"l-list l-list--tick\"><h6>Your Alison <span class=\"course-type\"></span> is:</h6><ul><li>Ideal for sharing with potential employers</li><li>Include it in your CV, professional social media profiles and job applications.</li><li>An indication of your commitment to continuously learn, upskill &amp; achieve high results.</li><li>An incentive for you to continue empowering yourself through lifelong learning.</li></ul></div><hr><div class=\"l-flex l-flex--even\"><div class=\"l-list l-list--bullet\"><h6>Alison offers <span class=\"l-list__color\">3 types</span> of Diplomas for completed Diploma courses:</h6><ul><li><strong>Digital <span class=\"course-type\"></span>:</strong> a downloadable <span class=\"course-type\"></span> in PDF format immediately available to you when you complete your purchase. </li><li><strong><span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security-marked <span class=\"course-type\"></span>, posted to you with FREE shipping. </li><li><strong>Framed <span class=\"course-type\"></span>:</strong> a physical version of your officially branded and security marked <span class=\"course-type\"></span> in a stylish frame, posted to you with FREE shipping. </li></ul></div><div class=\"l-diploma\"><img class=\"lazyload\" data-src=\"https://cdn01.alison-static.net/public/html/site/img/course-landing-v2/diploma.png\"><a class=\"course_btn course_btn--alt\" href=\"\"><span class=\"icon-thick-chevron-down right\"></span></a></div></div><p> All <span class=\"course-type\"></span> are available to purchase through the <a href=\"https://alison.com/shop\">Alison Shop</a>. For more information on purchasing Alison <span class=\"course-type\"></span>, please visit our <a href=\"https://alison.com/faqs\">FAQs</a>. If you decide not to purchase your Alison <span class=\"course-type\"></span>, you can still demonstrate your achievement by sharing your Learner Record or Learner Achievement Verification, both of which are accessible from your <a href=\"https://alison.com/dashboard\">Dashboard</a>. For more details on our <span class=\"course-type\"></span> pricing, please visit our <a href=\"https://alison.com/about/pricing\">Pricing Page</a></p>","modules":[{"name":"-","details":"-","description":"","topics":[]},{"name":"-","details":"-","description":"","topics":[]}]}